const go = document.querySelector("input");
const uo = document.querySelector("#user");
const qo = document.querySelector("#question");
const qs = `מה הצבע האהוב עליך?
מה היתה סדרת הטלויזיה שהכי נהנית ממנה בכל הזמנים?
ספר על מקום שטיילת בו והפתיע אותך כמה הוא יפה או מעניין
מאיזה שיר נהנית לשמוע לאחרונה?
מהו האמוג׳י שאתה משתמש בו הכי הרבה?
מה הקוד הראשון שאתה זוכר שכתבת?
איזה משחק היית לוקח לאי בודד?
אם היית צריך לבחור מאכל אחד לאכול באי בודד חוץ מקוקוסים ועשבים מה הוא היה?
את מי הערצת בתור ילד?
מהו המשקה האהוב עלייך?
באיזו מדינה היית חי אם לא פה?
מה אתה מעדיף? לאבד את כל הכסף בבנק או לאבד את כל התמונות שלך עד היום?
מה אתה מעדיף? להיכנס לכלא על משהו שלא עשית או לברוח מהחוק כל החיים?
מה אתה מעדיף? לחיות ולהסתדר באי בודד לבד לגמרי או בעיר גדולה בתור הומלס?
מה אתה מעדיף? להיות האדם הראשון על מאדים או לזכות במיליון דולר?
איזה יכולת תעדיף ליום? להיות בלתי נראה או לעוף?
מה תעדיף? להיות תקוע לשבוע בחדר חשוך לחלוטין או בחדר מואר מאוד?
מה תעדיף? אינטרנט או מזגן?
מה תעדיף? לקרוא מחשבות או לעשות טלפורט?
מה תעדיף? לשלוט בכוח המחשבה בחיות או במוצרי חשמל?`.split('\n');
const h = {};
h[0] = qs[0];
qs.forEach((q,i) => {
  const x = Math.floor(Math.random()*i);
  h[i]=h[x];
  h[x]=q;
});
h[20] =  'ניצלת, המשחק נגמר!';
const users = ['Player 1', 'Player 2', 'Player 3', 'Player 4'];
let counter = 0;
let user = 0;
go.addEventListener("click", () => {
  qo.innerHTML = h[counter++];
  uo.innerHTML = users[user++];
  if (user === users.length) user = 0;
});
